# AceleraDev Codenation - Semana 2 - Aula 3

# Felipe Carvalho Pereira

# Manipulando dados

In [1]:
# Importando os pacotes
import pandas as pd
import numpy as np

In [2]:
# Acessando o help dos pacotes
pd?

# Dicionários

In [3]:
# Criando os dicionários com os dados
dados = {'canal_venda' : ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
        'acessos': [100, 200, 300 ,400, 500],
        'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
        'vendas': [1000.52, 1052.34, 2002, 5000, 300 ]}

In [4]:
#para printar o dicionáario
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#verificando o tipo do dicionario
type(dados)

dict

In [6]:
#Acessando as chaves do meu dicionario
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [7]:
#Acessando uma chave especifica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [8]:
#Acessando uma posicao especifica de um dicionario
dados['acessos'][2] # Chave acessos no index 2

300

In [9]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][2] # Chave canal_venda no index 2

'instagram'

In [10]:
#Acessando uma posicao especifica de um dicionario
dados['canal_venda'][:3] # Chave canal_venda no index 3

['facebook', 'twitter', 'instagram']

# Aula 4 - Listas

In [11]:
type([1,2,3])

list

In [12]:
#Criando uma lista
lista = [200, 200 , 300 ,800, 200]

In [13]:
#printando a lista
lista

[200, 200, 300, 800, 200]

In [14]:
#Vendo valores especificos
lista[1]

200

In [15]:
#fatia da lista
lista[:3] # retorna até o indice 2

[200, 200, 300]

In [16]:
# Adicionando a lista ao dicionario 
dados['lista'] = lista

In [17]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 500],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 300, 800, 200]}

# Aula 4 - Data Frames

In [18]:
# Criar um data frame a partir de um dict
dataframe = pd.DataFrame(dados)

In [19]:
# Visualizando o dataframe
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200
2   instagram      300  site2  2002.00    300
3    linkedin      400  site2  5000.00    800
4    facebook      500  site3   300.00    200

In [20]:
# Printando os dois primeiros registros do dataframe
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebook      100  site1  1000.52    200
1     twitter      200  site1  1052.34    200

In [21]:
# Verificando o formato do dataframe
dataframe.shape

(5, 5)

In [22]:
QQRNOME = dataframe

In [23]:
QQRNOME.shape

(5, 5)

In [24]:
type(QQRNOME)

pandas.core.frame.DataFrame

In [25]:
# Verificando o indice do dataframe
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [26]:
#Verificando os tipos dos dados do dataframe
dataframe.dtypes

canal_venda     object
acessos          int64
site            object
vendas         float64
lista            int64
dtype: object

In [27]:
#Verificando se existem valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False  False   False  False

In [28]:
#printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [29]:
#Acessando uma coluna especifica
dataframe['canal_venda']

0     facebook
1      twitter
2    instagram
3     linkedin
4     facebook
Name: canal_venda, dtype: object

In [30]:
# Criando uma nova coluna
dataframe['nova_coluna'] = [1, 2, 3, 4, 5]

In [31]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [32]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [33]:
# Removendo colunas
dataframe.drop(columns = ['acessos','site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    300            3
3  5000.00    800            4
4   300.00    200            5

In [34]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [35]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [36]:
#Acessando valores especificos
dataframe['acessos'][1]

200

In [37]:
#Acessando fatia de coluna especifica
dataframe['canal_venda'][:2]

0    facebook
1     twitter
Name: canal_venda, dtype: object

In [38]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4
4    facebook      500  site3   300.00    200            5

In [39]:
# Fatiando os dados usando o iloc (linhas | colunas)
dataframe.iloc[3:,4:]

   lista  nova_coluna
3    800            4
4    200            5

In [40]:
#Fatiar os dados usando o loc (indice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1  1000.52    200            1
1     twitter      200  site1  1052.34    200            2
2   instagram      300  site2  2002.00    300            3
3    linkedin      400  site2  5000.00    800            4

In [41]:
# Selecionando colunas especificas
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebook  1000.52
1     twitter  1052.34
2   instagram  2002.00
3    linkedin  5000.00
4    facebook   300.00

In [42]:
# Passando os valores atraves de lista
filtro = ['canal_venda', 'acessos']

In [43]:
dataframe[filtro]

  canal_venda  acessos
0    facebook      100
1     twitter      200
2   instagram      300
3    linkedin      400
4    facebook      500

In [44]:
# Usando o metodo info()
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         5 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      int64
 5   nova_coluna  5 non-null      int64
dtypes: float64(1), int64(3), object(2)
memory usage: 368.0+ bytes

In [45]:
#Pivotando os dados (coluna)
aux = dataframe.pivot(index = 'canal_venda', columns='site', values='acessos')
print(aux)

site         site1  site2  site3
canal_venda
facebook     100.0    NaN  500.0
instagram      NaN  300.0    NaN
linkedin       NaN  400.0    NaN
twitter      200.0    NaN    NaN

Note que no pivotamento o index será a coluna determinada, no caso acima 'canal_venda', os dados na coluna 'site' se tornam colunas da nova tabela e a coluna 'acessos' vira os dados das colunas 'site'.

In [46]:
# Completando os valores faltantes usando fillna
# Pivotando os dados (coluna)
aux= dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns='site', values='acessos').fillna(0)

site         site1  site2  site3
canal_venda
facebook     100.0    0.0  500.0
instagram      0.0  300.0    0.0
linkedin       0.0  400.0    0.0
twitter      200.0    0.0    0.0

In [47]:
# Mudando as colunas usando o comando melt. O comando Melt é o oposto do pivotamento
dataframe.melt(id_vars='site', value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebook
1  site1  canal_venda    twitter
2  site2  canal_venda  instagram
3  site2  canal_venda   linkedin
4  site3  canal_venda   facebook

In [48]:
# Resetando o indice do dataframe
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['index', 'canal_venda', 'acessos', 'site', 'vendas', 'lista',
       'nova_coluna'],
      dtype='object')

In [49]:
# Somando as colunas do dataframe
# Tipo texto ele irá concatenar todos os valores e número somar mesmo
dataframe.sum()

canal_venda    facebooktwitterinstagramlinkedinfacebook
acessos                                            1500
site                          site1site1site2site2site3
vendas                                          9354.86
lista                                              1700
nova_coluna                                          15
dtype: object

In [50]:
#Somando as linhas do dataframe
dataframe.sum(axis = 1) # Soma apenas as variáveis numéricas na vertical, ignorando as categóricas

0    1301.52
1    1454.34
2    2605.00
3    6204.00
4    1005.00
dtype: float64

In [51]:
#Calculando a mediana das colunas numericas
print('Por linha: ',dataframe.median(axis= 1) ) # se eu indicar axis= 1, ele fará a operação na vertical  
print('Por coluna: ', dataframe.median()) # Se eu não indicar axis= 1, ele fará na horizontal

Por linha:  0    150.0
1    200.0
2    300.0
3    600.0
4    250.0
dtype: float64
Por coluna:  acessos         300.00
vendas         1052.34
lista           200.00
nova_coluna       3.00
dtype: float64

In [52]:
#Calculando a media das colunas númericas
dataframe.mean()

acessos         300.000
vendas         1870.972
lista           340.000
nova_coluna       3.000
dtype: float64

In [53]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dataframe.describe()

          acessos       vendas       lista  nova_coluna
count    5.000000     5.000000    5.000000     5.000000
mean   300.000000  1870.972000  340.000000     3.000000
std    158.113883  1850.931024  260.768096     1.581139
min    100.000000   300.000000  200.000000     1.000000
25%    200.000000  1000.520000  200.000000     2.000000
50%    300.000000  1052.340000  200.000000     3.000000
75%    400.000000  2002.000000  300.000000     4.000000
max    500.000000  5000.000000  800.000000     5.000000

In [54]:
#Calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebook      100  site1   300.00  200.0            1
1         NaN      200  site2  1000.52    NaN            2
2         NaN      300    NaN  1052.34    NaN            3
3         NaN      400    NaN  2002.00    NaN            4
4         NaN      500    NaN  5000.00    NaN            5

In [55]:
# Valor maximo por coluna
dataframe.max()

canal_venda    twitter
acessos            500
site             site3
vendas            5000
lista              800
nova_coluna          5
dtype: object

In [56]:
# Valor minimo por coluna
dataframe.min()

canal_venda    facebook
acessos             100
site              site1
vendas              300
lista               200
nova_coluna           1
dtype: object

In [57]:
# Printando o numero de unicos
dataframe.nunique()

canal_venda    4
acessos        5
site           3
vendas         5
lista          3
nova_coluna    5
dtype: int64

In [58]:
# Contando valores unicos de uma coluna
dataframe['canal_venda'].value_counts()

facebook     2
linkedin     1
twitter      1
instagram    1
Name: canal_venda, dtype: int64

In [59]:
# Valores unicos de uma coluna
dataframe['canal_venda'].unique()

array(['facebook', 'twitter', 'instagram', 'linkedin'], dtype=object)

In [60]:
# Usando o groupby com valores numericos, ou seja, somando os acessos em cada site
dataframe.groupby('site')['acessos'].sum()

site
site1    300
site2    700
site3    500
Name: acessos, dtype: int64

In [61]:
# Usando o groupby com valores numericos
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebook     300
instagram    300
linkedin     400
twitter      200
Name: acessos, dtype: int64

In [62]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].unique() # O Unique, evita a repetição dos valores

site
site1      [facebook, twitter]
site2    [instagram, linkedin]
site3               [facebook]
Name: canal_venda, dtype: object

In [63]:
# Usando o groupby com categoricos
dataframe.groupby('site')['canal_venda'].first() # O first irá retornar apenas o primeiro registro desse groupby

site
site1     facebook
site2    instagram
site3     facebook
Name: canal_venda, dtype: object

In [64]:
# Correlações entre variaveis
dataframe.corr(method = 'spearman') # spearman é o tipo de correlação que eu defini para utilizar

             acessos    vendas     lista  nova_coluna
acessos      1.00000  0.000000  0.335410      1.00000
vendas       0.00000  1.000000  0.894427      0.00000
lista        0.33541  0.894427  1.000000      0.33541
nova_coluna  1.00000  0.000000  0.335410      1.00000

In [65]:
# Criando variaveis categoricas por fatia de variavel numerica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'], # defini que a variável Vendas será a variável categorizada
                                       bins= (0, 1500, 2000, 8000),  # definindo os intervalos
                                       labels = ('0 a 1500', '1500 a 2000', '2000 a 8000')) # definindo apelido dos intervalos

In [66]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna categoria_vendas
0    facebook      100  site1  1000.52    200            1         0 a 1500
1     twitter      200  site1  1052.34    200            2         0 a 1500
2   instagram      300  site2  2002.00    300            3      2000 a 8000
3    linkedin      400  site2  5000.00    800            4      2000 a 8000
4    facebook      500  site3   300.00    200            5         0 a 1500

In [67]:
# Criando variavel categorica usando compressao de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [68]:
dataframe

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300

In [71]:
# Juntando dois dataframes | Criando o dataframe_2
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
               'suporte': ['Carlos', 'Carlos', 'Maria', 'Maria', 'Ezequiel']})
# Realizando o merge (leftjoin)
dataframe.merge(dataframe_2, on = 'site', how = 'left')
# chave 'site1' recebeu o valor 'Carlos' e assim sussecivamente, criando um nova coluna a esquerda

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos,suporte
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
1,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
2,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
3,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
4,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300,Maria
5,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300,Maria
6,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300,Maria
7,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300,Maria
8,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300,Ezequiel

In [72]:
#Salvando o dataframe como csv
dataframe.to_csv('dataframe.csv', sep = ';', decimal = ',', index = False)

In [73]:
#Lendo dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep = ';', decimal = ',')

In [74]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebook,100,site1,1000.52,200,1,0 a 1500,menor_que_300
1,twitter,200,site1,1052.34,200,2,0 a 1500,menor_que_300
2,instagram,300,site2,2002.00,300,3,2000 a 8000,menor_que_300
3,linkedin,400,site2,5000.00,800,4,2000 a 8000,maior_que_300
4,facebook,500,site3,300.00,200,5,0 a 1500,maior_que_300